{
  "recipes": [
    {
      "title": "Scrambled Eggs",
      "steps": [
        "Crack eggs into a bowl and whisk until smooth.",
        "Melt butter in a pan over medium heat.",
        "Pour eggs into the pan and stir gently until curds form.",
        "Remove from heat while slightly runny; season with salt and pepper."
      ],
      "clarifications": [
        "Tip: Whisk until the yolks and whites are fully combined.",
        "Tip: Use medium heat so the butter doesn’t burn.",
        "Tip: Stir slowly for soft curds instead of dry eggs.",
        "Tip: Remove slightly early; eggs will keep cooking off heat."
      ],
      "ingredients": ["2 eggs", "1 tbsp butter", "Salt", "Pepper"]
    },
    {
      "title": "Grilled Cheese",
      "steps": [
        "Butter one side of two slices of bread.",
        "Place cheese between the slices, buttered side out.",
        "Heat a skillet over medium heat.",
        "Cook until golden brown on both sides and cheese is melted."
      ],
      "clarifications": [
        "Tip: Use room-temperature butter for easier spreading.",
        "Tip: Cheddar or American cheese melts best.",
        "Tip: Press lightly with a spatula for even browning.",
        "Tip: Lower heat if bread browns too fast."
      ],
      "ingredients": ["2 slices bread", "2 slices cheese", "Butter"]
    },
    {
      "title": "Peanut Butter Sandwich",
      "steps": [
        "Lay two slices of bread on a plate.",
        "Spread peanut butter on one slice of bread.",
        "Spread jelly on the other slice of bread if desired.",
        "Press the slices together and cut in half."
      ],
      "clarifications": [
        "Tip: Use smooth peanut butter for easier spreading.",
        "Tip: Strawberry or grape jelly are classic choices.",
        "Tip: A butter knife works best for spreading evenly.",
        "Tip: Cutting diagonally makes it easier to eat."
      ],
      "ingredients": ["2 slices bread", "2 tbsp peanut butter", "1 tbsp jelly (optional)"]
    },
    {
      "title": "Oatmeal",
      "steps": [
        "Bring water or milk to a boil in a small pot.",
        "Add oats and reduce heat to medium.",
        "Cook while stirring occasionally until thick and creamy.",
        "Serve hot and add toppings of your choice."
      ],
      "clarifications": [
        "Tip: Use a 2-to-1 ratio of liquid to oats for creamier texture.",
        "Tip: Stir frequently to prevent sticking.",
        "Tip: Instant oats cook faster but are softer in texture.",
        "Tip: Common toppings include fruit, nuts, and honey."
      ],
      "ingredients": ["1 cup oats", "2 cups water or milk", "Pinch of salt", "Optional toppings"]
    },
    {
      "title": "Fruit Salad",
      "steps": [
        "Wash all fruits thoroughly under running water.",
        "Cut fruits into bite-sized pieces and place in a bowl.",
        "Mix fruits gently with a spoon.",
        "Optional: Add a drizzle of honey or squeeze of lemon juice."
      ],
      "clarifications": [
        "Tip: Use at least three types of fruit for variety.",
        "Tip: Removing seeds makes the salad easier to eat.",
        "Tip: A splash of lemon juice keeps fruits from browning.",
        "Tip: Chill before serving for better taste."
      ],
      "ingredients": ["1 apple", "1 banana", "1 cup grapes", "1 orange", "Optional: honey or lemon juice"]
    },
    {
      "title": "Pasta with Tomato Sauce",
      "steps": [
        "Bring a pot of salted water to a boil.",
        "Add pasta and cook until tender, stirring occasionally.",
        "Drain pasta and return to the pot.",
        "Pour tomato sauce over pasta and mix well before serving."
      ],
      "clarifications": [
        "Tip: Use about 1 teaspoon of salt per quart of water.",
        "Tip: Stir pasta in the first minute to prevent sticking.",
        "Tip: Save a little pasta water to thin the sauce if needed.",
        "Tip: Top with grated cheese for extra flavor."
      ],
      "ingredients": ["2 cups pasta", "1 jar tomato sauce", "1 tbsp olive oil", "Salt", "Grated cheese (optional)"]
    },
    {
      "title": "Smoothie",
      "steps": [
        "Gather your choice of fruits, yogurt, and a liquid base.",
        "Place all ingredients into a blender.",
        "Blend until smooth and creamy.",
        "Pour into a glass and enjoy immediately."
      ],
      "clarifications": [
        "Tip: Use frozen fruits for a thicker texture.",
        "Tip: Greek yogurt adds protein and creaminess.",
        "Tip: Add a handful of spinach for extra nutrients without altering taste.",
        "Tip: Adjust the liquid amount to reach your desired consistency."
      ],
      "ingredients": ["1 cup mixed fruits", "1/2 cup yogurt", "1/2 cup milk or juice", "Optional: honey or spinach"]
    },
    {
      "title": "Tuna Salad",
      "steps": [
        "Open the can of tuna and drain the liquid.",
        "In a bowl, mix tuna with mayonnaise and diced celery.",
        "Serve the salad with a side of croutons or a drizzle of mustard oil."
        ],
      "clarifications": [
        "Tip: Use a can of tuna that has a 2-3% salt content.",
        "Tip: Add a splash of mustard oil for added flavor.",
        "Tip: Dice celery for a more even salad."
      ],
      "ingredients": ["1 can tuna", "1 tbsp mayonnaise", "1 cup diced celery"]
    },
    {
      "title": "Yogurt Parfait",
      "steps": [
        "In a glass or bowl, layer yogurt, granola, and fresh fruit.",
        "Repeat layers until the container is full.",
        "Top with a drizzle of honey if desired.",
        "Serve immediately or chill for later."
      ],
      "clarifications": [
        "Tip: Use Greek yogurt for a thicker texture.",
        "Tip: Fresh berries work well for layering.",
        "Tip: Granola adds a nice crunch to the parfait.",
        "Tip: Drizzle honey on top for added sweetness."
      ],
      "ingredients": ["1 cup yogurt", "1/2 cup granola", "1/2 cup fresh fruit", "Optional: honey"]
    },
    {
      "title": "Avocado Toast",
      "steps": [
        "Toast a slice of bread to your desired level of crispiness.",
        "Cut an avocado in half, remove the pit, and scoop the flesh into a bowl.",
        "Mash the avocado with a fork and season with salt and pepper.",
        "Spread the mashed avocado onto the toasted bread and serve."
      ],
      "clarifications": [
        "Tip: Use ripe avocados for easier mashing.",
        "Tip: Add a squeeze of lemon juice to prevent browning.",
        "Tip: Sprinkle red pepper flakes for a spicy kick.",
        "Tip: Top with a poached egg for extra protein."
      ],
      "ingredients": ["1 slice bread", "1 ripe avocado", "Salt", "Pepper", "Optional: lemon juice, red pepper flakes, poached egg"]
    },
    {
      "title": "Caprese Salad",
      "steps": [
        "Slice fresh tomatoes and mozzarella cheese into even rounds.",
        "Arrange tomato and mozzarella slices alternately on a plate.",
        "Tuck fresh basil leaves between the slices.",
        "Drizzle with olive oil and balsamic vinegar, then season with salt and pepper."
      ],
      "clarifications": [
        "Tip: Use ripe, in-season tomatoes for the best flavor.",
        "Tip: Fresh mozzarella is softer and more flavorful than pre-packaged.",
        "Tip: Tear basil leaves for a more rustic look.",
        "Tip: Let the salad sit for a few minutes to allow flavors to meld."
      ],
      "ingredients": ["2 large tomatoes", "8 oz fresh mozzarella", "Fresh basil leaves", "2 tbsp olive oil", "1 tbsp balsamic vinegar", "Salt", "Pepper"]
    }
  ]
}